aaron-bond.better-comments
abusaidm.html-snippets
adpyke.codesnap
alexcvzz.vscode-sqlite
chris-noring.node-snippets
christian-kohler.npm-intellisense
CoenraadS.bracket-pair-colorizer-2
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
ecmel.vscode-html-css
eg2.vscode-npm-script
esbenp.prettier-vscode
FallenMax.mithril-emmet
fknop.vscode-npm
formulahendry.auto-rename-tag
GitHub.github-vscode-theme
GoBystrokReactJS.gobystrok
HookyQR.beautify
icrawl.discord-vscode
kleber-swf.unity-code-snippets
kreativ-software.csharpextensions
mgmcdermott.vscode-language-babel
ms-azuretools.vscode-docker
ms-dotnettools.csharp
patcx.vscode-nuget-gallery
PKief.material-icon-theme
ritwickdey.LiveServer
skyran.js-jsx-snippets
Thomaz.preparing
tht13.html-preview-vscode
vscode-snippet.snippet
whizkydee.material-palenight-theme
xabikos.JavaScriptSnippets
YclepticStudios.unity-snippets
zhuangtongfa.material-theme
